# Parameter Type Id Rbs Elec Circuit Cable Size Param Property

Source: https://www.revitapidocs.com/2026/783b6ce9-56b3-c264-f1e5-ac8aa93353f6.htm

---

| Parameter Type Id Rbs Elec Circuit Cable Size Param Property |
| --- |

"Cable Size"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RbsElecCircuitCableSizeParam { get; }
```

```
Public Shared ReadOnly Property RbsElecCircuitCableSizeParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RbsElecCircuitCableSizeParam {
	ForgeTypeId^ get ();
}
```

```
static member RbsElecCircuitCableSizeParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace